Revit 2027 API
ParameterTypeId.LockAlignmentUiToggle Property
 "Lock": This is used by the UI to allow selection of lock alignment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LockAlignmentUiToggle { get; }
Public Shared ReadOnly Property LockAlignmentUiToggle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LockAlignmentUiToggle {
	ForgeTypeId^ get ();
}
static member LockAlignmentUiToggle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace